Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.h
/*
 * CDDL HEADER START
 *
 * The contents of this file are subject to the terms of the
 * Common Development and Distribution License (the "License").
 * You may not use this file except in compliance with the License.
 *
 * You can obtain a copy of the license at usr/src/OPENSOLARIS.LICENSE
 * or http://www.opensolaris.org/os/licensing.
 * See the License for the specific language governing permissions
 * and limitations under the License.
 *
 * When distributing Covered Code, include this CDDL HEADER in each
 * file and include the License file at usr/src/OPENSOLARIS.LICENSE.
 * If applicable, add the following below this CDDL HEADER, with the
 * fields enclosed by brackets "[]" replaced with your own identifying
 * information: Portions Copyright [yyyy] [name of copyright owner]
 *
 * CDDL HEADER END
 */

/*
 *  Copyright (c) 2010, Oracle and/or its affiliates. All rights reserved.
 */

#ifndef	_MCXNEX_MISC_H
#define	_MCXNEX_MISC_H

/*
 * mcxnex_misc.h
 *    Contains all of the prototypes, #defines, and structures necessary
 *    for the Miscellaneous routines - Address Handle, Multicast,
 *    Protection Domain, port-related, statistics (kstat) routines, and
 *    extra VTS related routines.
 *    Many of these functions are called by other parts of the driver
 *    (and several routines are directly exposed through the IBTF CI
 *    interface and/or kstat interface).
 */

#include <sys/types.h>
#include <sys/conf.h>
#include <sys/ddi.h>
#include <sys/sunddi.h>

#include "mcxnex_typedef.h"
#include "mcxnex_ioctl.h"
#include "mcxnex_rsrc.h"
#include "mcxnex_hw.h"


/*
 * The following defines specify the default number of Address Handles (AH)
 * and their size (in the hardware).  By default the maximum number of address
 * handles is set to 32K.  This value is controllable through the
 * "mcxnex_log_num_ah" configuration variable.  Note:  Mcxnex Address Handles
 * are also referred to as UD Address Vectors (UDAV).
 */
#define	MCXNEX_NUM_AH_SHIFT		0xF
#define	MCXNEX_NUM_AH			(1 << MCXNEX_NUM_AH_SHIFT)
#define	MCXNEX_UDAV_SIZE_SHIFT		0x5
#define	MCXNEX_UDAV_SIZE		(1 << MCXNEX_UDAV_SIZE_SHIFT)

/*
 * The following macro determines whether the contents of a UDAV need to be
 * sync'd (with ddi_dma_sync()).  This decision is based on whether the
 * UDAV is in DDR memory (no sync) or system memory (sync required).
 */

#define	MCXNEX_UDAV_IS_SYNC_REQ(state)					\
	(((&((state)->ts_rsrc_hdl[MCXNEX_UDAV]))->rsrc_loc ==		\
	MCXNEX_IN_DDR) ? 0 : 1)

/*
 * These defines are used by mcxnex_get_addr_path() and mcxnex_set_addr_path()
 * below.  They indicate the type of hardware context being passed in the
 * "path" argument.  Because the Mcxnex hardware formats for the QP address
 * path and UDAV address path structures is so similar, but not exactly the
 * same, we use these flags to indicate which type of structure is being
 * read from or written to.
 */
#define	MCXNEX_ADDRPATH_QP		0x0
#define	MCXNEX_ADDRPATH_UDAV		0x1

/*
 * The following defines specify the default number of Multicast Groups (MCG)
 * and the maximum number of QP which can be associated with each.  By default
 * the maximum number of multicast groups is set to 256, and the maximum number
 * of QP per multicast group is set to 248 (256 4-byte slots minus the 8 slots
 * in the header).  The first of these values is controllable through the
 * "mcxnex_log_num_mcg" configuration variable.  "mcxnex_num_qp_per_mcg" is
 * also available if the customer needs such a large capability.
 */
#define	MCXNEX_NUM_MCG_SHIFT		0x8
#define	MCXNEX_NUM_QP_PER_MCG_MIN	0x8
#define	MCXNEX_NUM_QP_PER_MCG		0xf8

#define	MCXNEX_MCGMEM_SZ(state)						\
	((((state)->hs_cfg_profile->cp_num_qp_per_mcg) + 8) << 2)

/*
 * Macro to compute the offset of the QP list in a given MCG entry.
 */
#define	MCXNEX_MCG_GET_QPLIST_PTR(mcg)					\
	((mcxnex_hw_mcg_qp_list_t *)((uintptr_t)(mcg) +			\
	sizeof (mcxnex_hw_mcg_t)))

/*
 * The following defines specify the characteristics of the Mcxnex multicast
 * group hash table.  The MCXNEX_NUM_MCG_HASH_SHIFT defines the size of the
 * hash table (as a power-of-2), which is set to 16 by default.  This value
 * is controllable through the "mcxnex_log_num_mcg_hash" configuration variable,
 * but serious consideration should be taken before changing this value.  Note:
 * its appropriate size should be a function of the entire table size (as
 * defined by "mcxnex_log_num_mcg" and MCXNEX_NUM_MCG_SHIFT above).
 */
#define	MCXNEX_NUM_MCG_HASH_SHIFT	0x4

/*
 * The following defines are used by the multicast routines to determine
 * if a given "multicast GID" is valid or not (see mcxnex_mcg_is_mgid_valid
 * for more details.  These values are pulled from the IBA specification,
 * rev. 1.1
 */
#define	MCXNEX_MCG_TOPBITS_SHIFT	56
#define	MCXNEX_MCG_TOPBITS_MASK		0xFF
#define	MCXNEX_MCG_TOPBITS		0xFF

#define	MCXNEX_MCG_FLAGS_SHIFT		52
#define	MCXNEX_MCG_FLAGS_MASK		0xF
#define	MCXNEX_MCG_FLAGS_PERM		0x0
#define	MCXNEX_MCG_FLAGS_NONPERM	0x1

#define	MCXNEX_MCG_SCOPE_SHIFT		48
#define	MCXNEX_MCG_SCOPE_MASK		0xF
#define	MCXNEX_MCG_SCOPE_LINKLOC	0x2
#define	MCXNEX_MCG_SCOPE_SITELOC	0x5
#define	MCXNEX_MCG_SCOPE_ORGLOC		0x8
#define	MCXNEX_MCG_SCOPE_GLOBAL		0xE


/*
 * The following defines specify the default number of Protection Domains (PD).
 * By default the maximum number of protection domains is set to 64K.  This
 * value is controllable through the "mcxnex_log_num_pd" configuration variable.
 */
#define	MCXNEX_NUM_PD_SHIFT		0x10

/*
 * The following defines specify the default number of Partition Keys (PKey)
 * per port.  By default the maximum number of PKeys is set to 32 per port, for
 * a total of 64 (assuming two ports) .  This value is controllable through the
 * "mcxnex_log_max_pkeytbl" configuration variable.
 */
#define	MCXNEX_NUM_PKEYTBL_SHIFT	0x5
#define	MCXNEX_NUM_PKEYTBL		(1 << MCXNEX_NUM_PKEYTBL_SHIFT)

/*
 * The following defines specify the default number of SGIDs per port.  By
 * default the maximum number of GIDS per port is set to 16.  This value
 * is controllable through the "mcxnex_log_max_gidtbl" configuration variable.
 */
#define	MCXNEX_NUM_GIDTBL_SHIFT		0x4
#define	MCXNEX_NUM_GIDTBL		(1 << MCXNEX_NUM_GIDTBL_SHIFT)

