Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.h
/*
 * Below is a define which is the default number of UAR pages.  By default, the
 * maximum number of UAR pages is set to 1024 for mcxnex.  Note that
 * BlueFlame (if enabled) will  take 1/2 the space behind BAR1 (the UAR BAR)
 * and therefore we must limit this even further.  This value is controllable
 * through the "mcxnex_log_num_uar" configuration variable. NOTE: This value
 * should not be set larger than 15 (0xF) because the UAR index number is
 * used as part of the minor number calculation (see mcxnex_open() for details)
 * and the minor numbers should not be larger than eighteen bits (i.e. 15 bits
 * of UAR index, 3 bits of driver instance number).  This is especially true
 * for 32-bit kernels.
 */
#define	MCXNEX_NUM_UAR_SHIFT		0xA

/*
 * A DoorBell record (DBr) will be handled uniquely.  They are not in ICM now,
 * so they don't need the mapping.  And they just need to be accessible to the
 * HCA as an address, so we don't need to register the memory.  AND, since
 * user level (uDAPL, OPEN verbs) won't ever do the unmapping of them we don't
 * really need to worry about that either.  And the DBrs will have to live in
 * user mappable memory.  So, we can shortcut a lot of things given these
 * assumptions.
 *
 * Other facts:  the DBrs for Mcxnex are only two per qp - one for the Receive
 * side (RQ or SRQ) and one for the CQ.  If a QP is associated with an SRQ, we
 * only need the ONE for the SRQ.  Also, although the RQ/SRQ DBr is only 4-bytes
 * while the CQ DBr is 8-bytes, all DBrs will be 8-bytes (see the union below).
 * Though it may lead to minor wastage, it also means that reuse is easier since
 * any DBr can be used for either, and we don't have to play allocation games.
 *
 * The state structure will hold the pointer to the start of a list of struct
 * mcxnex_dbr_info_s, each one containing the necessary information to manage
 * a page of DBr's.
 */

typedef uint64_t mcxnex_dbr_t;

typedef struct mcxnex_dbr_info_s {
	struct mcxnex_dbr_info_s *dbr_link;
	mcxnex_dbr_t		*dbr_page;	/* virtual addr of page */
	uint64_t		dbr_paddr;	/* physical addr of page */
	ddi_acc_handle_t	dbr_acchdl;
	ddi_dma_handle_t	dbr_dmahdl;
	uint32_t		dbr_nfree;	/* #free DBrs in this page */
	uint32_t		dbr_firstfree;	/* idx of first free DBr */
} mcxnex_dbr_info_t;

#define	MCXNEX_NUM_DBR_PER_PAGE	(PAGESIZE / sizeof (mcxnex_dbr_t))


/*
 * These defines specify some miscellaneous port-related configuration
 * information.  Specifically, MCXNEX_MAX_MTU is used to define the maximum
 * MTU supported for each Mcxnex port, MCXNEX_MAX_PORT_WIDTH is used to define
 * the maximum supported port width, and the MCXNEX_MAX_VLCAP define is used
 * to specify the maximum number of VLs supported, excluding VL15.  Both
 * of these values are controllable and get be set using the "mcxnex_max_mtu"
 * and "mcxnex_max_vlcap" configuration variables.  Note: as with many of the
 * configurable variables, caution should be exercised when changing these
 * values.  These values, specifically, should not be set any larger than
 * they are defined here as these are set to the current Mcxnex device
 * maximums.
 *
 * Note that:  with Mcxnex, these capabilities that were formerly retrieved
 * 	as part of QUERY_DEV_LIM/CAP must now be retrieved with QUERY_PORT.
 *	The init sequence will have to be altered vis-a-vis the older HCAs to
 *	accommodate this change.
 *
 *	Also, the maximums will be changed here for now.
 */
#define	MCXNEX_MAX_MTU		0x5 /* was 0x4, 2048 but moved to 4096 */
#define	MCXNEX_ETH_MTU		0x7
#define	MCXNEX_ETH_MSG_MAX	0x1f
#define	MCXNEX_MAX_PORT_WIDTH	0x7 /* was 0x3 (1x/4x) but now 1/4/8x */
#define	MCXNEX_MAX_VLCAP	0x8 /* remain the same for now */

/*
 * These last defines are used by the statistics counting routines (kstats)
 * for initialization of the structures associated with the IB statistics
 * access routines.  The MCXNEX_CNTR_MASK and MCXNEX_CNTR_SIZE defines are
 * used to divide the "pcr" register into two 32-bit counters (one for "pic0"
 * and the other for "pic1")
 */
#define	MCXNEX_CNTR_MASK		0xFFFFFFFF
#define	MCXNEX_CNTR_SIZE		32
#define	MCXNEX_CNTR_NUMENTRIES	17



#define	MCXNEX_QUEUE_LOCATION_NORMAL	0x1
#define	MCXNEX_QUEUE_LOCATION_USERLAND	0x2

/*
 * Minimum number of ticks to delay between successive polls of the CQ in
 * VTS ioctl loopback test
 */
#define	MCXNEX_VTS_LOOPBACK_MIN_WAIT_DUR	50

/*
 * UAR software table, layout and associated structures
 */

/*
 * Doorbell record table bitmap macros
 */
#define	MCXNEX_IND_BYTE(ind)		((ind) >> 3)
#define	MCXNEX_IND_BIT(ind)		(1 << ((ind) & 0x7))

#define	MCXNEX_BMAP_BIT_SET(bmap, ind)	\
	((bmap)[MCXNEX_IND_BYTE(ind)] |= MCXNEX_IND_BIT(ind))
#define	MCXNEX_BMAP_BIT_CLR(bmap, ind)	\
	((bmap)[MCXNEX_IND_BYTE(ind)] &= ~MCXNEX_IND_BIT(ind))
#define	MCXNEX_BMAP_BIT_ISSET(bmap, ind)	\
	((bmap)[MCXNEX_IND_BYTE(ind)] & MCXNEX_IND_BIT(ind))


/*
 * User doorbell record page tracking
 */
typedef struct mcxnex_udbr_page_s mcxnex_udbr_page_t;

struct mcxnex_udbr_page_s {
	mcxnex_udbr_page_t	*upg_link;
	uint_t			upg_index;
	uint_t			upg_nfree;
	uint64_t		*upg_free;
	caddr_t			upg_kvaddr;
	struct buf		*upg_buf;
	ddi_umem_cookie_t	upg_umemcookie;
	ddi_dma_handle_t	upg_dmahdl;
	ddi_dma_cookie_t 	upg_dmacookie;
};

typedef struct mcxnex_udbr_mgmt_s mcxnex_user_dbr_t;

struct mcxnex_udbr_mgmt_s {
	mcxnex_user_dbr_t	*udbr_link;
	uint_t			udbr_index;	/* same as uarpg */
	mcxnex_udbr_page_t	*udbr_pagep;
};


/*
 * doorbell tracking end
 */

/*
 * The mcxnex_sw_ah_s structure is also referred to using the "mcxnex_ahhdl_t"
 * typedef (see mcxnex_typedef.h).  It encodes all the information necessary
 * to track the various resources needed to allocate, query, modify, and
 * free an address handle.
 *
 * In specific, it has a lock to ensure single-threaded access. It stores a
 * pointer to the associated PD handle, and also contains a copy of the
 * GUID stored into the address handle.  The reason for this extra copy of
 * the GUID info has to do with Mcxnex PRM compliance and is fully explained
 * in mcxnex_misc.c
 *
 * To serve in it's primary function, it also contains a UDAV, which contains
 * all of the data associated with the UD address vector that is being
 * utilized by the holder of the address handle. The hardware-specific format
 * of the UDAV is defined in the mcxnex_hw.h file.
 *
 * It also has the always necessary backpointer to the resource for the AH
 * handle structure itself.
 */
struct mcxnex_sw_ah_s {
	kmutex_t	ah_lock;
	mcxnex_pdhdl_t	ah_pdhdl;
	mcxnex_hw_udav_t *ah_udav;
	mcxnex_rsrc_t	*ah_rsrcp;
	uint64_t	ah_save_guid;
};
