Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.h
_NOTE(READ_ONLY_DATA(mcxnex_sw_ah_s::ah_udav))
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_sw_ah_s::ah_lock,
    mcxnex_sw_ah_s::ah_pdhdl
    mcxnex_sw_ah_s::ah_rsrcp
    mcxnex_sw_ah_s::ah_save_guid))

/*
 * The mcxnex_sw_mcg_list_s structure is also referred to using the
 * "mcxnex_mcghdl_t" typedef (see mcxnex_typedef.h).  It encodes all the
 * information necessary to track the various resources needed to for attaching
 * and detaching QP from multicast groups.
 *
 * The Mcxnex driver keeps an array of these and uses them as a shadow for
 * the real HW-based MCG table.  They hold all the necessary information
 * to track the resources and to allow fast access to the MCG table.  First,
 * it had a 128-bit multicast GID (stored in "mcg_mgid_h" and "mcg_mgid_l".
 * next if has a field to indicate the index of the next mcxnex_mcghdl_t in
 * the current hash chain (zero is the end of the chain).  Note: this very
 * closely mimics what the hardware MCG entry has. Then it has a field to
 * indicate how many QP are currently attached to the given MCG.  And, lastly,
 * it has the obligatory backpointer to the resource for the MCH handle
 * structure itself.
 */
struct mcxnex_sw_mcg_list_s {
	uint64_t	mcg_mgid_h;
	uint64_t	mcg_mgid_l;
	uint_t		mcg_next_indx;
	uint_t		mcg_num_qps;
	mcxnex_rsrc_t	*mcg_rsrcp;
};

/*
 * The mcxnex_sw_pd_s structure is also referred to using the "mcxnex_pdhdl_t"
 * typedef (see mcxnex_typedef.h).  It encodes all the information necessary
 * to track the various resources needed to allocate and free protection
 * domains
 *
 * Specifically, it has reference count and a lock to ensure single threaded
 * access to it.  It has a field for the protection domain number ("pd_pdnum").
 * And it also has the obligatory backpointer to the resource for the PD
 * handle structure itself.
 */
struct mcxnex_sw_pd_s {
	kmutex_t	pd_lock;
	uint32_t	pd_pdnum;
	uint32_t	pd_refcnt;
	mcxnex_rsrc_t	*pd_rsrcp;
};
_NOTE(READ_ONLY_DATA(mcxnex_sw_pd_s::pd_pdnum
    mcxnex_sw_pd_s::pd_rsrcp))
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_sw_pd_s::pd_lock,
    mcxnex_sw_pd_s::pd_refcnt))

/*
 * The mcxnex_qalloc_info_s structure is also referred to using the
 * "mcxnex_qalloc_info_t" typedef (see mcxnex_typedef.h).  It holds all the
 * information necessary to track the resources for each of the various Mcxnex
 * queue types (i.e. Event Queue, Completion Queue, Work Queue).
 *
 * Specifically, it has the size, alignment restrictions, and location (in DDR
 * or in system memory).  And depending on the location, it also has the
 * ddi_dma_handle_t, ddi_acc_handle_t, and pointers used for reading/writing to
 * the queue's memory.
 */
struct mcxnex_qalloc_info_s {
	uint64_t		qa_size;
	uint64_t		qa_alloc_align;
	uint64_t		qa_bind_align;
	uint32_t		*qa_buf_real;
	uint32_t		*qa_buf_aligned;
	uint64_t		qa_buf_realsz;
	uint_t			qa_pgoffs;
	uint_t			qa_location;
	ddi_dma_handle_t	qa_dmahdl;
	ddi_acc_handle_t	qa_acchdl;
	ddi_umem_cookie_t	qa_umemcookie;
};

/*
 * The mcxnex_ks_mask_t structure encodes all the information necessary for
 * the individual kstat entries.  The "ks_reg_offset" field contains the
 * hardware offset for the corresponding counter, and "ks_reg_shift" and
 * "ks_reg_mask" contain shift and mask registers used by the access routines.
 * Also the "ks_old_pic0" and "ks_old_pic1" fields contain the most recently
 * read value for the corresponding port ("pic").  Note:  An array of these
 * structures is part of the "mcxnex_ks_info_t" structure below.
 */
typedef struct mcxnex_ks_mask_s {
	char		*ks_evt_name;
	uint32_t	ks_old_pic0;
	uint32_t	ks_old_pic1;
} mcxnex_ks_mask_t;

/*
 * Index into the named data components of 64 bit "perf_counters" kstat.
 */
enum {
	MCXNEX_PERFCNTR64_ENABLE_IDX = 0,
	MCXNEX_PERFCNTR64_XMIT_DATA_IDX,
	MCXNEX_PERFCNTR64_RECV_DATA_IDX,
	MCXNEX_PERFCNTR64_XMIT_PKTS_IDX,
	MCXNEX_PERFCNTR64_RECV_PKTS_IDX,
	MCXNEX_PERFCNTR64_NUM_COUNTERS
};

/*
 * Data associated with the 64 bit "perf_counters" kstat. One for each port.
 */
typedef struct mcxnex_perfcntr64_ks_info_s {
	struct kstat	*hki64_ksp;
	int		hki64_ext_port_counters_supported;
	int		hki64_enabled;
	uint64_t	hki64_counters[MCXNEX_PERFCNTR64_NUM_COUNTERS];
	uint32_t	hki64_last_read[MCXNEX_PERFCNTR64_NUM_COUNTERS];
	uint_t		hki64_port_num;
	mcxnex_state_t	*hki64_state;
} mcxnex_perfcntr64_ks_info_t;

/*
 * The mcxnex_ks_info_t structure stores all the information necessary for
 * tracking the resources associated with each of the various kstats.  In
 * addition to containing pointers to each of the counter and pic kstats,
 * this structure also contains "hki_pcr" which is the control register that
 * determines which of the countable entries (from the "hki_ib_perfcnt[]"
 * array) is being currently accessed.
 */
typedef struct mcxnex_ks_info_s {
	struct kstat	*hki_cntr_ksp;
	struct kstat	*hki_picN_ksp[MCXNEX_MAX_PORTS];
	uint64_t	hki_pcr;
	uint64_t	hki_pic0;
	uint64_t	hki_pic1;
	mcxnex_ks_mask_t	hki_ib_perfcnt[MCXNEX_CNTR_NUMENTRIES];
	kt_did_t	hki_perfcntr64_thread_id;
	kmutex_t	hki_perfcntr64_lock;
	kcondvar_t	hki_perfcntr64_cv;
	uint_t		hki_perfcntr64_flags;	/* see below */
	mcxnex_perfcntr64_ks_info_t	hki_perfcntr64[MCXNEX_MAX_PORTS];
} mcxnex_ks_info_t;

/* hki_perfcntr64_flags */
#define	MCXNEX_PERFCNTR64_THREAD_CREATED	0x0001
#define	MCXNEX_PERFCNTR64_THREAD_EXIT		0x0002

/*
 * The mcxnex_ports_ioctl32_t, mcxnex_loopback_ioctl32_t, and
 * mcxnex_flash_ioctl32_s structures are used internally by the Mcxnex
 * driver to accomodate 32-bit applications which need to access the
 * Mcxnex ioctls.  They are 32-bit versions of externally available
 * structures defined in mcxnex_ioctl.h
 */
typedef struct mcxnex_ports_ioctl32_s {
	uint_t			ap_revision;
	caddr32_t		ap_ports;
	uint8_t			ap_num_ports;
} mcxnex_ports_ioctl32_t;

typedef struct mcxnex_loopback_ioctl32_s {
	uint_t			alb_revision;
	caddr32_t		alb_send_buf;
	caddr32_t		alb_fail_buf;
	uint_t			alb_buf_sz;
	uint_t			alb_num_iter;
	uint_t			alb_pass_done;
	uint_t			alb_timeout;
	mcxnex_loopback_error_t	alb_error_type;
	uint8_t			alb_port_num;
	uint8_t			alb_num_retry;
} mcxnex_loopback_ioctl32_t;

typedef struct mcxnex_flash_ioctl32_s {
	uint32_t	af_type;
	caddr32_t	af_sector;
	uint32_t	af_sector_num;
	uint32_t	af_addr;
	uint32_t	af_quadlet;
	uint8_t		af_byte;
} mcxnex_flash_ioctl32_t;

