Arquivotheca/solaris11/usr/src/uts/common/io/mcxnex/mcxnex_misc.h
/*
 * The mcxnex_loopback_comm_t and mcxnex_loopback_state_t structures below
 * are used to store all of the relevant state information needed to keep
 * track of a single VTS ioctl loopback test run.
 */
typedef struct mcxnex_loopback_comm_s {
	uint8_t			*hlc_buf;
	size_t			hlc_buf_sz;
	ibt_mr_desc_t		hlc_mrdesc;

	mcxnex_mrhdl_t		hlc_mrhdl;
	mcxnex_cqhdl_t		hlc_cqhdl[2];
	mcxnex_qphdl_t		hlc_qp_hdl;

	ibt_mr_attr_t		hlc_memattr;
	uint_t			hlc_qp_num;
	ibt_cq_attr_t		hlc_cq_attr;
	ibt_qp_alloc_attr_t	hlc_qp_attr;
	ibt_chan_sizes_t	hlc_chan_sizes;
	ibt_qp_info_t		hlc_qp_info;
	ibt_queue_sizes_t	hlc_queue_sizes;
	ibt_send_wr_t		hlc_wr;
	ibt_wr_ds_t		hlc_sgl;
	ibt_wc_t		hlc_wc;
	uint_t			hlc_num_polled;
	ibt_status_t		hlc_status;
	int			hlc_complete;
	int			hlc_wrid;
} mcxnex_loopback_comm_t;

typedef struct mcxnex_loopback_state_s {
	uint8_t			hls_port;
	uint_t			hls_lid;
	uint8_t			hls_retry;
	mcxnex_state_t		*hls_state;
	ibc_hca_hdl_t		hls_hca_hdl;
	mcxnex_pdhdl_t		hls_pd_hdl;
	mcxnex_loopback_comm_t	hls_tx;
	mcxnex_loopback_comm_t	hls_rx;
	ibt_status_t		hls_status;
	int			hls_err;
	int			hls_pkey_ix;
	int			hls_timeout;
} mcxnex_loopback_state_t;

/*
 * Mellanox FMR
 */
typedef struct mcxnex_fmr_list_s {
	avl_node_t			fmr_avlnode;
	struct mcxnex_fmr_list_s		*fmr_next;

	mcxnex_mrhdl_t			fmr;
	ibt_pmr_desc_t			fmr_desc;
	mcxnex_fmrhdl_t			fmr_pool;
	uint_t				fmr_refcnt;
	uint_t				fmr_remaps;
	uint_t				fmr_in_cache;
} mcxnex_fmr_list_t;

struct mcxnex_sw_fmr_s {
	mcxnex_state_t			*fmr_state;

	kmutex_t			fmr_lock;
	ddi_taskq_t			*fmr_taskq;

	ibt_fmr_flush_handler_t		fmr_flush_function;
	void				*fmr_flush_arg;

	int				fmr_pool_size;
	int				fmr_max_pages;
	int				fmr_page_sz;
	int				fmr_dirty_watermark;
	int				fmr_dirty_len;
	int				fmr_flags;

	mcxnex_fmr_list_t		*fmr_free_list;
	mcxnex_fmr_list_t		*fmr_dirty_list;

	int				fmr_cache;
	avl_tree_t			fmr_cache_avl;
	kmutex_t			fmr_cachelock;
};
_NOTE(MUTEX_PROTECTS_DATA(mcxnex_sw_fmr_s::fmr_lock,
    mcxnex_sw_fmr_s::fmr_state
    mcxnex_sw_fmr_s::fmr_pool_size
    mcxnex_sw_fmr_s::fmr_max_pages
    mcxnex_sw_fmr_s::fmr_page_sz
    mcxnex_sw_fmr_s::fmr_dirty_watermark
    mcxnex_sw_fmr_s::fmr_dirty_len
    mcxnex_sw_fmr_s::fmr_flags
    mcxnex_sw_fmr_s::fmr_free_list
    mcxnex_sw_fmr_s::fmr_dirty_list
    mcxnex_sw_fmr_s::fmr_cache))

_NOTE(MUTEX_PROTECTS_DATA(mcxnex_sw_fmr_s::fmr_cachelock,
    mcxnex_sw_fmr_s::fmr_cache_avl))

#define	MCXNEX_FMR_MAX_REMAPS		32

/* Mcxnex doorbell record routines */

int mcxnex_dbr_page_alloc(mcxnex_state_t *state, mcxnex_dbr_info_t **info);
int mcxnex_dbr_alloc(mcxnex_state_t *state, uint_t index,
    ddi_acc_handle_t *acchdl, mcxnex_dbr_t **vdbr, uint64_t *pdbr,
    uint64_t *mapoffset);
void mcxnex_dbr_free(mcxnex_state_t *state, uint_t indx, mcxnex_dbr_t *record);
void mcxnex_dbr_kern_free(mcxnex_state_t *state);

/* Mcxnex Fast Memory Registration Routines */
int mcxnex_create_fmr_pool(mcxnex_state_t *state, mcxnex_pdhdl_t pdhdl,
    ibt_fmr_pool_attr_t *params, mcxnex_fmrhdl_t *fmrhdl);
int mcxnex_destroy_fmr_pool(mcxnex_state_t *state, mcxnex_fmrhdl_t fmrhdl);
int mcxnex_flush_fmr_pool(mcxnex_state_t *state, mcxnex_fmrhdl_t fmrhdl);
int mcxnex_register_physical_fmr(mcxnex_state_t *state, mcxnex_fmrhdl_t fmrhdl,
    ibt_pmr_attr_t *mem_pattr_p, mcxnex_mrhdl_t *mrhdl,
    ibt_pmr_desc_t *mem_desc_p);
int mcxnex_deregister_fmr(mcxnex_state_t *state, mcxnex_mrhdl_t mr);


/* Mcxnex Address Handle routines */
int mcxnex_ah_alloc(mcxnex_state_t *state, mcxnex_pdhdl_t pd,
    ibt_adds_vect_t *attr_p, mcxnex_ahhdl_t *ahhdl, uint_t sleepflag);
int mcxnex_ah_free(mcxnex_state_t *state, mcxnex_ahhdl_t *ahhdl,
    uint_t sleepflag);
int mcxnex_ah_query(mcxnex_state_t *state, mcxnex_ahhdl_t ahhdl,
    mcxnex_pdhdl_t *pdhdl, ibt_adds_vect_t *attr_p);
int mcxnex_ah_modify(mcxnex_state_t *state, mcxnex_ahhdl_t ahhdl,
    ibt_adds_vect_t *attr_p);

/* Mcxnex Multicast Group routines */
int mcxnex_mcg_attach(mcxnex_state_t *state, mcxnex_qphdl_t qphdl, ib_gid_t gid,
    ib_lid_t lid);
int mcxnex_mcg_detach(mcxnex_state_t *state, mcxnex_qphdl_t qphdl, ib_gid_t gid,
    ib_lid_t lid);

/* Mcxnex Protection Domain routines */
int mcxnex_pd_alloc(mcxnex_state_t *state, mcxnex_pdhdl_t *pdhdl,
    uint_t sleepflag);
int mcxnex_pd_free(mcxnex_state_t *state, mcxnex_pdhdl_t *pdhdl);
void mcxnex_pd_refcnt_inc(mcxnex_pdhdl_t pd);
void mcxnex_pd_refcnt_dec(mcxnex_pdhdl_t pd);

/* Mcxnex port-related routines */
int mcxnex_port_query(mcxnex_state_t *state, uint_t port,
    ibt_hca_portinfo_t *pi);

/* Mcxnex statistics (kstat) routines */
int mcxnex_kstat_init(mcxnex_state_t *state);
void mcxnex_kstat_fini(mcxnex_state_t *state);

/* Miscellaneous routines */
int mcxnex_set_addr_path(mcxnex_state_t *state, ibt_adds_vect_t *av,
    mcxnex_hw_addr_path_t *path, uint_t type);
void mcxnex_get_addr_path(mcxnex_state_t *state, mcxnex_hw_addr_path_t *path,
    ibt_adds_vect_t *av, uint_t type);
int mcxnex_portnum_is_valid(mcxnex_state_t *state, uint_t portnum);
int mcxnex_pkeyindex_is_valid(mcxnex_state_t *state, uint_t pkeyindx);
int mcxnex_queue_alloc(mcxnex_state_t *state, mcxnex_qalloc_info_t *qa_info,
    uint_t sleepflag);
void mcxnex_queue_free(mcxnex_qalloc_info_t *qa_info);
int mcxnex_get_dma_cookies(mcxnex_state_t *state, ibt_phys_buf_t *paddr_list_p,
    ibt_va_attr_t *va_attrs, uint_t list_len, uint_t *cookiecnt,
    ibc_ma_hdl_t *ibc_ma_hdl_p);
int mcxnex_split_dma_cookies(mcxnex_state_t *state,
    ibt_phys_buf_t *paddr_list_p, ib_memlen_t *paddr_offset_p,
    uint_t list_len, uint_t *cookiecnt, uint_t pagesize);
int mcxnex_dma_cookie_shift(ibt_phys_buf_t *paddr_list, int start, int end,
    int cookiecnt, int num_shift);
int mcxnex_free_dma_cookies(ibc_ma_hdl_t ibc_ma_hdl);
int mcxnex_log2(long x);


#endif	/* _MCXNEX_MISC_H */
